poc/results/x-cross/chaos/ybdb-vm-6node-P-A-rc-20260808T144840+0800-chaos/scenarioC7/fio-summary.txt
chaos-c7-contention: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
[...]

chaos-c7-contention: (groupid=0, jobs=4): err= 0: pid=12835: Sat Aug  8 15:51:50 2026
  write: IOPS=71.6k, BW=280MiB/s (293MB/s)(8388MiB/30002msec); 0 zone resets
    slat (nsec): min=1120, max=86593k, avg=39644.89, stdev=878882.55
    clat (usec): min=247, max=108532, avg=3536.61, stdev=7594.99
     lat (usec): min=252, max=108538, avg=3576.35, stdev=7641.57
    clat percentiles (usec):
     |  1.00th=[  529],  5.00th=[  725], 10.00th=[  881], 20.00th=[ 1074],
     | 30.00th=[ 1270], 40.00th=[ 1532], 50.00th=[ 1876], 60.00th=[ 2409],
     | 70.00th=[ 3163], 80.00th=[ 3949], 90.00th=[ 5276], 95.00th=[ 7963],
     | 99.00th=[60556], 99.50th=[67634], 99.90th=[72877], 99.95th=[77071],
     | 99.99th=[89654]
   bw (  KiB/s): min=158592, max=584936, per=98.04%, avg=280666.63, stdev=19705.91, samples=236
   iops        : min=39648, max=146234, avg=70166.61, stdev=4926.50, samples=236
  lat (usec)   : 250=0.01%, 500=0.73%, 750=4.88%, 1000=10.46%
  lat (msec)   : 2=37.13%, 4=27.50%, 10=15.40%, 20=2.13%, 50=0.57%
  lat (msec)   : 100=1.19%, 250=0.01%
  cpu          : usr=1.73%, sys=8.66%, ctx=213189, majf=0, minf=54
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,2147206,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=280MiB/s (293MB/s), 280MiB/s-280MiB/s (293MB/s-293MB/s), io=8388MiB (8795MB), run=30002-30002msec

Disk stats (read/write):
  sda: ios=8/2735920, merge=0/116608, ticks=8/2538844, in_queue=2538851, util=45.11%